app/controllers/board_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaaaa"], ["content", "bbbbbb"], ["created_at", "2022-01-27 04:43:01.523763"], ["updated_at", "2022-01-27 04:43:01.523763"]]
---
	def create
		title1 = params[:title]
		content1 = params[:content]
		Post.create(title: title1, content: content1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "a"], ["content", "b"], ["updated_at", "2022-01-27 06:08:00.020906"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])
		@post.title = params[:title]
		@post.content = params[:content]
		@post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
	def delete
		@post = Post.find(params[:id])
		@post.destroy